Repository: WeatherWaterClimateServices/wwcs
Catalog: WWCS/irrigation/telegramBot/*.po
Languages: tg

source: 🔄 Please check the current water level in the channel and send its value
tg: 🔄 Лутфан сатҳи ҳозираи обро дар обченкунак санҷед ва арзиши онро равон кунед.

source: ⏰ Watering time is over! Please click the 'Save data' button to save the results.
tg: ⏰ Вақти обёрӣ ба охир расид! Лутфан тугмачаи 'Сабти маълумот' -ро пахш кунед, то натиҷаҳо сабт карда шаванд.

source: 🌤 Good morning, {first_name}! Your plot is ready for irrigation. 💧 Water required: {water:.2f} m³
tg: 🌤 Салом, {first_name}!\n" Имрӯз Шумо бояд заминро дар ҳаҷми 💧{water:.2f} m³ обёрӣ кунед. Барои муаян кардани давомнокии вақти обмонӣ шумо бояд ба обёрии замин шурӯ кунед ва сатҳи обро сари вақт дар ништак ба ман муаян кунед.

source: Enter the current water level in the channel (in cm):
tg: Лутфан, ҳозир сатҳи обро аз руи обченкунак равон кунед (см):

source: ❌ Your data was not found in the system
tg: ❌ Маълумоти шумо дар система ёфт нашуд

source: ⚠️ Incorrect water level! Acceptable values from 1 to 25 cm. Please enter the correct value:
tg: ⚠️ Сатҳи об нодуруст! Арзишҳои қобили қабул аз 1 то 25 см. Лутфан арзиши дурустро ворид кунед:

source: ✅ Irrigation completed! Enough water.
tg: ✅ Обёрӣ анҷом ёфт! Оби кофӣ.

source: 💦 Current level: {water_level} cm ⏱ Time left: {hours}h {minutes}m 📊 Used: {used_m3:.2f} m³ of {total_m3:.2f} m³
tg: 💦 Сатҳи ҳозира: {water_level} см ⏱ Мӯҳлати обёрӣ: {hours} соат {minutes} дакика 📊 Истифода шуд: {used_m3:.2f} м³ аз {total_m3:.2f} м³

source: ⚠️ Please enter a valid number (water level in cm)
tg: ⚠️ Лутфан рақами дурустро ворид кунед (сатҳи об дар см)

source: ✅ Data saved! Used: {used_m3:.2f} m³
tg: ✅ Натиҷаҳо сабт шуданд! Ҳамагӣ об истифода шуд: {used_m3:.2f} м³

source: ⚠️ Error saving data
tg: ⚠️ Хато ҳангоми сабти маълумот

source: Enter actual water consumption (m³):
tg: Истеъмоли воқеии обро ворид кунед (м³):

source: ✅ Data saved! Water used: {used_m3:.2f} m³ Equivalent to: {equivalent_mm:.2f} mm
tg: ✅ Натиҷаҳо сабт шуданд! Истифода щуд: {used_m3:.2f} м³ Баробар аст ба: {equivalent_mm:.2f} мм

source: ⚠️ Please enter a valid number (e.g. 150 or 75.5)
tg: ⚠️ Лутфан рақами дурустро ворид кунед (масалан, 150 ё 75,5)
