Repository: WeatherWaterClimateServices/wwcs
Catalog: WWCS/irrigation/telegramBot/locale/*/LC_MESSAGES/messages.po
Languages: tg, uz

source: ❌ I have you registered, but I don't find the required irrigation data in the system. Please contact support or try again tomorrow.
tg: ❌ Ман шуморо сабти ном кардам, аммо дар система маълумоти зарурӣ оиди обёрии замини Шумо наёфтам. Лутфан ба ёвари хизматрасонӣ тамос гиред ё фардо дубора кӯшиш кунед.

source: ❌ I am sorry, your telegramID is not in our system. Please contact support.
tg: ❌ Бубахшед, Telegram ID-и шумо дар системаи мо вуҷуд надорад. Лутфан барои бақайдгирии он ба ёвари хизматрасонӣ тамос гиред.

source: ❌ I am sorry, you have already registered your irrigation. Please contact support.
tg: ❌ Бубахшед, шумо аллакай ҳаҷми обёрии худро дар система сабт кардаед. Лутфан барои кӯмак ба ёвари хизматрасонӣ тамос гиред.

source: ⚠️ I cannot read from the database. Try again later or contact support.
tg: ⚠️ Ман аз базаи маълумотҳо хонда ва ё ёфта натавониста истодаам. Баъдтар бори дигар кӯшиш кунед ё барои кӯмак ба ёвари хизматрасонӣ тамос гиред.

source: Start Irrigation
tg: Оғози обёрӣ

source: Irrigation finished
tg: Анҷоми обёрӣ

source: 🔄 Please check the current water level in the channel. If it has changed by more than 2cm, press 'Start irrigation' again and update the water level.
tg: 🔄 Лутфан сатҳи ҳозираи обро дар канал санҷед. Агар сатҳи об зиёда аз 2 см тағйир ёфта бошад, тугмаи «Оғози обёрӣ»-ро боз пахш кунед ва сатҳи нави обро ворид намоед.

source: ⏰ Watering time is over! Please stop the water flow and then click the 'Irrigation finished' button.
tg: ⏰ Вақти обёрии замин ба охир расид! Лутфан ҷараёни обро қатъ кунед ва сипас тугмаи «Анҷоми обёрӣ» -ро пахш кунед.

source: ❌ Missing information: I have not found field type (control/treatment) or meter type in my database for your site. Please contact support.
tg: ❌ Маълумот намерасад: Ман дар базаи маълумотҳо барои майдони замини шумо намуди майдон (муқарарӣ/таҷрибавӣ) ё намуди обченкунакро наёфтам. Лутфан барои кӯмак ба ёвари хизматрасонӣ тамос гиред.

source: ❌ Missing information: I have not found irrigationNeed, area, wetted area or irrigation efficiency in my database for your site. Please contact support.
tg: ❌ Маълумот намерасад: Ман дар базаи маълумотҳо барои замини шумо маълумот оид ба ҳаҷми обёрӣ, андозаи замин, андозаи замини таршуда ва ё коэффисиенти самаранокии обёриро пайдо карда натавонистам. Лутфан ба ёвари хизматрасонӣ тамос гиред.

source: 🌤 Good morning, {first_name}, on your treatment plot, growing {crop}. I will give you a recommendation for irrigation and will guide you through the data entry. 💧 Your plot needs: {water:.2f} m³ of irrigation. If you want to irrigate, press 'Start irrigation'. Otherwise simply come back tomorrow.
tg: 🌤 Субҳ ба хайр, {first_name}, дар замини таҷрибавии шумо {crop} парвариш карда мешавад. Ман ба шумо оиди ҳаҷмӣ зарурии обёрии ин зирот тавсия пешниҳод мекунам ва шуморо дар ворид кардани маълумот роҳнамоӣ мекунам. 💧 Қитъаи замини шумо барои обёрӣ ба {water:.2f} м³ ниёз дорад. Агар шумо хоҳед, ки обёрӣ кунед, тугмаи «Оғози обёрӣ» -ро пахш унед. Агар не, пагоҳ боз баргардед.

source: 🌤 Good morning, {first_name}, on your treatment plot, growing {crop}. I will give you a recommendation for irrigation and will guide you through the data entry. 💧 Please irrigate: {water:.2f} m³. When finished, press the 'Irrigation finished' button.
tg: 🌤 Субҳ ба хайр, {first_name}, дар замини таҷрибавии шумо {crop} парвариш карда мешавад. Ман ба шумо оиди ҳаҷмӣ зарурии обёрии ин зирот тавсия пешниҳод мекунам ва шуморо дар ворид кардани маълумот роҳнамоӣ мекунам. 💧 Лутфан обёрӣ кунед дар ҳаҷми: {water:.2f} м³. Ҳангоми анҷоми обёрӣ тугмаи «Анҷоми обёрӣ»-ро пахш кунед.

source: 🌤 Good morning, {first_name}, on your treatment plot, growing {crop}. I will give you a recommendation for irrigation and will guide you through the data entry: 💧 Your plot is currently not under water stress, and I don't recommend to irrigate. If you want to irrigate nevertheless, don't apply more than {water:.2f} m³ of irrigation. Press 'Start irrigation' if you want to irrigate. Otherwise simply come back tomorrow.
tg: 🌤 Субҳ ба хайр, {first_name}, дар замини таҷрибавии шумо {crop} парвариш карда мешавад. Ман ба шумо оиди ҳаҷмӣ зарурии обёрии ин зирот тавсия пешниҳод мекунам ва шуморо дар ворид кардани маълумот роҳнамоӣ мекунам. 💧 Қитъаи замини шумо айни ҳоло зери фишори беобӣ нест, бинобар ин тавсия намедиҳам, ки обёрӣ кунед. Агар шумо бо вуҷуди ин обёрӣ кардан хоҳед, аз {water:.2f} м3 зиёд обёрӣ накунед. Барои сар кардани обёрӣ тугмаи «Оғози обёрӣ»-ро пахш кунед. Агар не, пагоҳ боз баргардед.

source: 🌤 Good morning, {first_name}, on your control plot, growing {crop}. I will guide you through the irrigation data entry. If you want to irrigation today, please go ahead. When you have finished irrigation, press button 'Irrigation finished'. Otherwise simply come back tomorrow.
tg: 🌤 Субҳ ба хайр, {first_name}, дар қитъаи назоратии шумо {crop} парвариш карда мешавад. Ман шуморо дар ворид кардани маълумот роҳнамоӣ мекунам. Агар шумо имруз обёрӣ кардан хоҳед, пас обёри кунед. Вақте ки шумо обёриро анҷом додед, тугмаи «Анҷоми обёрӣ» -ро пахш кунед. Дар акси ҳол, пагоҳ баргардед.

source: 🌤 Good morning, {first_name}, on your control plot, growing {crop}. I will guide you through the irrigation data entry. If you want to irrigate today, press 'Start irrigation'. Otherwise simply come back tomorrow.
tg: 🌤 Субҳ ба хайр, {first_name}, дар қитъаи назоратии шумо {crop} парвариш карда мешавад. Ман шуморо дар ворид кардани маълумот роҳнамоӣ мекунам. Агар шумо имруз обёрӣ кардан хоҳед, пас тугмаи «Оғози обёрӣ»-ро пахш кунед. Дар акси ҳол, пагоҳ баргардед.

source: ⚠️ The plot type or metering device information in the database is wrong for your site. Please contact support.
tg: ⚠️ Маълумоти намуди майдон ё намуди обченкунак дар базаи маълумотҳо барои қитъаи замини шумо нодуруст ба қайд гирифта шудааст. Лутфан барои кӯмак бо ёвари хизматрасонӣ тамос гиред.

source: The bot has started successfully
tg: Бот бомуваффақият ба кор шурӯъ кард.

source: As soon as the water level has stabilized, enter the water level (in cm):
tg: Ҳамин ки сатҳи об дар дастгоҳи обченкунак мӯътадил шуд, баландии сатҳи обро ворид кунед (см):

source: Enter the m³ on your counter BEFORE irrigation:
tg: Нишондоди ҳисобкунаки обро ПЕШ аз обёрӣ бо м³ ворид кунед:

source: After irrigation, press 'Irrigation finished' and enter m³ used water in total
tg: Пас аз анҷоми обёрӣ, тугмаи «Анҷоми обёрӣ» -ро пахш кунед ва ҳаҷми умумии оби истифодашударо ворид кунед

source: ⚠️ I need a water level from 0 to 25 cm. Please enter the correct value as a whole number (e.g. 0, 1, 2...):
tg: ⚠️ Ба ман сатҳи об аз 0 то 25 см лозим аст. Лутфан рақами дурустро ҳамчун пурра (бе бутун) ворид кунед (масалан, 0. 1. 2...):

source: ✅ Thank you. Whenever the water level changes by more than 2cm press 'Start irrigation' and enter the new level. Enter 0 if water stops. Press 'Irrigation finished' when done.
tg: ✅ Раҳмат. Ҳар вақте ки сатҳи об зиёда аз 2 см тағйир ёбад, тугмаи «Оғози обёрӣ»-ро боз пахш кунед ва сатҳи навро ворид намоед. Агар дар давоми обёрӣ об қатъ шавад, рақами 0 ворид кунед. Аммо, вақте ки обёрӣ аз рӯи тавсия анҷом ёбад, тугмаи «Анҷоми обёрӣ» -ро пахш кунед.

source: 🔄 Updated: +{used_water:.2f} m³ used (total: {total_used:.2f} m³). Whenever the water level changes by more than 2cm press 'Start irrigation' and enter the new level. Enter 0 if water stops. Press 'Irrigation finished' when done.
tg: 🔄 Маълумоти навшуда: +{used_water:.2f} м³ истифода шудааст (ҳамагӣ: {total_used:.2f} м³). Ҳар вақте ки сатҳи об зиёда аз 2 см тағйир ёбад, тугмаи «Оғози обёрӣ»-ро боз пахш кунед ва сатҳи навро ворид намоед. Агар дар давоми обёрӣ об қатъ шавад, рақами 0 ворид кунед. Аммо, вақте ки обёрӣ аз рӯи тавсия анҷом ёбад, тугмаи «Анҷоми обёрӣ» -ро пахш кунед.

source: ⚠️ An error occurred. Please try again. If you get this message again, contact support.
tg: ⚠️ Хатогие рух дод. Лутфан бори дигар кӯшиш кунед. Агар шумо ин паёмакро дубора дарёфт кардед, бо ёвари хизматрасонӣ барои кӯмак тамос гиред.

source: ⚠️ The value cannot be negative. Please try again with a positive number.
tg: ⚠️ Рақами воридкардашуда набояд манфӣ (минус) бошад. Лутфан, рақами мусбат (бе минус) ворид кунед.

source: ✅ Thank you. Irrigate until your counter is at: {target_counter:.2f} m³ 💧 Water needed: {m3_needed:.2f} m³ When you have finished irrigation, press button ‘Irrigation finished.'
tg: ✅ Раҳмат. То он даме обёри кунед, ки нишондиҳандаи ҳисобкунаки оби шумо ба {target_counter:.2f} м³ расад. 💧 Ҳаҷми оби зарурӣ: {m3_needed:.2f} м³ Вақте ки шумо обёриро анҷом додед, тугмаи «Анҷоми обёрӣ» -ро пахш кунед.

source: ✅ When you have finished irrigation, press button 'Irrigation finished.'
tg: ✅ Вақте ки шумо обёриро анҷом додед, тугмаи «Анҷоми обёрӣ» -ро пахш кунед.

source: ⚠️ Please enter a valid positive number (e.g., 125.5).
tg: ⚠️ Лутфан рақами мусбати дурустро ворид кунед (масалан, 125,5).

source: Thank you. 💦 At this level {water_level} cm, the recommended irrigation duration is ⏱ {hours}h {minutes}m Whenever the water level changes by more than 2cm, press 'Start irrigation' one more time and enter the new water level. Enter 0 if no water flows. Press 'Irrigation finished' when you stop. 📊 Used: {used_m3:.2f} m³ of {total_m3:.2f} m³
tg: Раҳмат. 💦 Дар ҳамин сатҳи {water_level} см, вақти тавсияшавандаи обёрӣ ⏱ {hours} соат ва {minutes} дақиқа мебошад. Ҳар вақте ки сатҳи об зиёда аз 2 см тағйир ёбад, тугмаи «Оғози обёрӣ»-ро боз пахш кунед ва сатҳи навро ворид намоед. Агар дар давоми обёрӣ об қатъ шавад, рақами 0 ворид кунед. Аммо, вақте ки обёрӣ аз рӯи тавсия анҷом ёбад, тугмаи «Онҷоми обёрӣ» -ро пахш кунед. 📊 Истифодашуда: {used_m3:.2f} м³ аз {total_m3:.2f} м³

source: Please enter the volume that you irrigated today (in m³):
tg: Лутфан ҳаҷми обе, ки имрӯз обёрӣ кардед, бо м³ ворид кунед:

source: Enter the m³ on your counter AFTER irrigation:
tg: Нишондоди ҳисобкунаки обро БАЪД аз обёрӣ бо м³ ворид кунед:

source: I don't have the m³ on your counter from before the irrigation. Press 'Start irrigation' button to enter this first.
tg: Ман нишондиҳандаи ҳисобкунаки оби шуморо ПЕШ аз обёрӣ надорам. Барои ворид кардани ин тугмаи «Оғози обёрӣ»-ро пахш кунед

source: ❌ No active irrigation session found. Press 'Start irrigation' button to start one.
tg: ❌ Ягон фаъолияти фаъоли обёрӣ ёфт нашуд. Барои оғози фаъолияти обёрӣ тугмаи "Оғози обёрӣ"-ро пахш кунед.

source: ⚠️ Error saving data. Please contact support.
tg: ⚠️ Хато ҳангоми сабткунии маълумот. Лутфан барои кӯмак бо ёвари хизматрасонӣ тамос гиред.

source: ⚠️ The m³ on your counter after irrigation must be more than what it was before irrigation. Please enter the m³ on your counter after irrigation again!
tg: ⚠️ Нишондоди обченкунак БАД аз обёрӣ (м³) бояд аз нишондоди ПЕШ аз обёрӣ (м³) зиёд бошад. Лутфан, дубора нишондоди ПАС аз обёрии обченкунакро бо м³ ворид кунед!

source: ⚠️Error: The value cannot be negative. Please try again with a positive number.
tg: ⚠️Хато: Арзиш манфӣ шуда наметавоанад. Лутфан бо рақами мусбат бори дигар ворид кунед.

source: ✅ Enough water, please stop irrigation.
tg: ✅ Обёрии кофӣ, лутфан обдиҳии заминро ба охир расонед.

source: 💦 Current level: {water_level} cm ⏱ Time left: {hours}h {minutes}m 📊 Used: {used_m3:.2f} m³ of {total_m3:.2f} m³
tg: 💦 Сатҳи ҷорӣ: {water_level} см ⏱ Вақти боқимонда: {hours} соат вa {minutes} дақиқа 📊 Истифодашуда: {used_m3:.2f} м³ аз {total_m3:.2f} м³
uz: 💦 Joriy daraja: {water_level} sm ⏱ Vaqt qoldi: {hours}s {minutes} d 📊 Ishlatilgan: {used_m3:.2f} m³ / {total_m3:.2f} m³

source: 🔢 Required: {m3_need} m³ water
tg: 🔢 Ниёз ба об: {m3_need} м³

source: ❌ I cannot provide you with a recommendation for your field type / metering device. Please contact support.
tg: ❌ Айни ҳол ман наметавонам ба шумо оиди навъи майдон ва ё намуди обченкунак тавсия диҳам. Лутфан барои кӯмак бо ёвари хизматрасонӣ тамос гиред.

source: ⚠️ I could not calculate the recommended irrigation duration and volume. Please contact support.
tg: ⚠️ Айни ҳол ман оиди давомнокии тавсияшавандаи обёрӣ ва ё ҳаҷми зарури обёриро ҳисоб карда натавониста истодаам. Лутфан барои кӯмак бо ёвари хизматрасонӣ тамос гиред.

source: ✅ Data saved! Water used: {used_m3:.2f} m³ Equivalent to: {actual_mm:.2f} mm See you tomorrow!
tg: ✅ Маълумот сабт карда шуд! Оби истифодашуда: {used_m3:.2f} м³ Баробар аст ба: {actual_mm:.2f} мм То пагоҳ! 🌞

source: Send recommendation
uz: Tavsiya yuboring

source: No water
uz: Suv yo'q

source: Save data
uz: Maʼlumotlarni saqlash

source: 🔄 Please check the current water level in the channel and send its value
uz: 🔄 Iltimos, kanaldagi hozirgi suv darajasini tekshiring va uning qiymatini yuboring

source: ⏰ Watering time is over! Please click the 'Save data' button to save the results.
uz: ⏰ Sug'orish vaqti tugadi! Iltimos, saqlash uchun "Ma'lumotlarni saqlash" tugmasini bosing.

source: 🌤 Good morning, {first_name}! Your plot is ready for irrigation. 💧 Water required: {water:.2f} m³
uz: 🌤 Xayrli tong, {first_name}! Sizning uchastkangiz sug'orishga tayyor. 💧 Kerakli suv: {water:.2f} m³

source: Hello, {first_name}! If your irrigation complete please push Save data button and enter you counter numbers Before and After irrigation and save your data
uz: Salom, {first_name}! Agar sug'orish tugallangan bo'lsa, "Ma'lumotlarni saqlash" tugmasini bosing va sug'orishdan oldin va keyin hisoblagich raqamlarini kiriting va ma'lumotlaringizni saqlang

source: ERROR!
uz: XATO!

source: Enter the current water level in the channel (in cm):
uz: Kanaldagi joriy suv darajasini kiriting (sm bilan):

source: Please, send the counter value before irrigation (m³):
uz: Iltimos, sug'orishdan oldin hisoblagich qiymatini yuboring (m³):

source: ❌ Your data was not found in the system
uz: ❌ Sizning ma'lumotlaringiz tizimda topilmadi

source: Irrigate untill you counter is: {target_counter:.2f} m³ Water need: {m3_needed:.2f} m³
uz: Hisoblagich: {target_counter:.2f} m³ bo'lguncha sug'oring Suvga bo'lgan ehtiyoj: {m3_needed:.2f} m³

source: ⚠️ Please, type number (125.5)
uz: ⚠️ Iltimos, raqam kiriting (125.5)

source: ⚠️ Incorrect water level! Acceptable values from 1 to 25 cm. Please enter the correct value:
uz: ⚠️ Suv darajasi noto'g'ri! Qabul qilinadigan qiymatlar 1 dan 25 sm. "Iltimos, to'g'ri qiymatni kiriting:

source: ✅ Irrigation completed! Enough water.
uz: ✅ Sug'orish tugallandi! Suv yetarli.

source: ⚠️ Please enter a valid number (water level in cm)
uz: ⚠️ Iltimos, to‘g‘ri raqamni kiriting (suv darajasi sm)

source: Please, send your counter number after irrigation (m³):
uz: Iltimos, sug'orishdan keyin hisoblagich raqamingizni yuboring (m³):

source: Please, send your counter number BEFORE irrigation (m³)
uz: Iltimos, sug'orishdan oldin hisoblagich raqamingizni yuboring (m³)

source: ✅ Data saved! Used: {used_m3:.2f} m³
uz: ✅ Maʼlumotlar saqlandi! Ishlatilgan: {used_m3:.2f} m³

source: ⚠️ Error saving data
uz: ⚠️ Maʼlumotlarni saqlashda xatolik yuz berdi

source: Wrong fieldtype
uz: Noto'g'ri maydon turi

source: Now send counter value AFTER irrigation (m³)
uz: Endi hisoblagich qiymatini sug'orishdan keyin yuboring (m³)

source: ⚠️ Type correct number (like 125.5)
uz: ⚠️ To'g'ri raqamni kiriting (masalan, 125,5)

source: ⚠️ Error: start value is greater than end value!
uz: ⚠️ Xato: boshlang'ich qiymati yakuniy qiymatdan kattaroq!

source: ✅ Data saved! Water used: {used_m3:.2f} m³ Equivalent to: {actual_mm:.2f} mm
uz: ✅ Maʼlumotlar saqlandi! Ishlatilgan suv: {used_m3:.2f} m³ Ekvivalent: {actual_mm:.2f} mm

source: ❌ Error: No start data found
uz: ❌ Xato: Boshlanish maʼlumotlari topilmadi

source: ⚠️ Error: The initial value of the counter cannot be greater than the final value! Please enter correct data.
uz: ⚠️ Xato: Hisoblagichning dastlabki qiymati yakuniy qiymatdan katta boʻlishi mumkin emas! Iltimos, toʻgʻri maʼlumotlarni kiriting.

source: ⚠️ Please enter a valid number (e.g. 150 or 75.5)
uz: ⚠️ Yaroqli raqamni kiriting (masalan, 150 yoki 75,5)
