Repository: WeatherWaterClimateServices/wwcs
Catalog: WWCS/irrigation/telegramBot/locale/kh/LC_MESSAGES/messages.po
Languages: kh

source: Send recommendation
kh: áŸá¼á˜á•áŸ’áŠá›áŸ‹á€á¶ášááŸ‚á“á¶áŸ† / Send recommendation

source: No water
kh: á‚áŸ’á˜á¶á“á‘á¹á€ / No water

source: Save data
kh: ášá€áŸ’áŸá¶á‘á»á€á‘á·á“áŸ’á“á“áŸá™ / Save data

source: ğŸ”„ Please check the current water level in the channel and send its value
kh: ğŸ”„ áŸá¼á˜á–á·á“á·ááŸ’á™á˜á¾á›áá½ášá›áŸáá“áŸ…á€áŸ’á“á»á„á€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€ / Please check the current water level in the channel and send its value

source: â° Watering time is over! Please click the 'Save data' button to save the results.
kh: â° á”á“áŸ’á‘á¶á”áŸ‹á–á¸áŸáŸ’ášáŸ„á…á‘á¹á€á á¾á™! áŸá¼á˜á…á»á…á–á¶á€áŸ’á™ 'ášá€áŸ’áŸá¶á‘á»á€á‘á·á“áŸ’á“á“áŸá™' áŠá¾á˜áŸ’á”á¸ášá€áŸ’áŸá¶á‘á»á€ 'á›á‘áŸ’á’á•á›' / Watering time is over! Please click the 'Save data' button to save the results.

source: ğŸŒ¤ Good morning, {first_name}! Your plot is ready for irrigation. ğŸ’§ Water required: {water:.2f} mÂ³
kh: ğŸŒ¤ á¢ášá»ááŸá½áŸáŸ’áá¸ / Good morning, {first_name}! á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€áŠá›áŸ‹á–áŸá›áŸáŸ’ášáŸ„á…á‘á¹á€á á¾á™ áŸ” / Your plot is ready for irrigation. á‘á¹á€áŠáŸ‚á›ááŸ’ášá¼áœá€á¶ášáŸ– {water:.2f} mÂ³ / Water required: {water:.2f} mÂ³

source: ERROR!
kh: á˜á·á“á”á¶á“áŸá˜áŸ’ášáŸá… / ERROR!

source: Enter the current water level in the channel (in cm):
kh: áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá”á…áŸ’á…á»á”áŸ’á”á“áŸ’á“á“áŸ…á€áŸ’á“á»á„á€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€ (áŸá„áŸ‹á‘á¸á˜áŸ‰áŸ‚ááŸ’áš) / Enter the current water level in the channel (in cm):

source: Please, send the counter value before irrigation (mÂ³):
kh: áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€á˜á»á“á–áŸá›áŸáŸ’ášáŸ„á…áŸáŸ’ášá– (mÂ³): / Please, send the counter value before irrigation (mÂ³):

source: âŒ Your data was not found in the system
kh: âŒá‘á·á“áŸ’á“á“áŸá™ášá”áŸáŸ‹á¢áŸ’á“á€á˜á·á“ááŸ’ášá¼áœá”á¶á“ášá€áƒá¾á‰á“áŸ…á€áŸ’á“á»á„á”áŸ’ášá–áŸá“áŸ’á’á‘áŸ / Your data was not found in the system

source: Irrigate untill you counter is: {target_counter:.2f} mÂ³ Water need: {m3_needed:.2f} mÂ³
kh: áŸáŸ’ášáŸ„á…áŸáŸ’ášá–ášá á¼ááŠá›áŸ‹á€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’á‚áŸ’ášá”áŸ‹á…áŸ†á“á½á“á€áŸ†áááŸ‹áŸ– {target_counter:.2f} mÂ³ / Irrigate until your counter is: {target_counter:.2f} mÂ³ á…áŸ†á“á½á“á‘á¹á€áŠáŸ‚á›ááŸ’ášá¼áœá€á¶ášáŸáŸ’ášáŸ„á…áŸáŸ’ášá–áŸ– {m3_needed:.2f} mÂ³ / Water need: {m3_needed:.2f} mÂ³

source: âš ï¸ Please, type number (125.5)
kh: âš ï¸ áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€áŠáŸ‚á›ááŸ’ášá¹á˜ááŸ’ášá¼áœ / Please, type number (125.5)

source: âš ï¸ Incorrect water level! Acceptable values from 1 to 25 cm. Please enter the correct value:
kh: âš ï¸ áá½ášá›áŸáá˜á·á“ááŸ’ášá¹á˜ááŸ’ášá¼áœ! áá½ášá›áŸááŠáŸ‚á›á¢á¶á…á”á‰áŸ’á…á¼á›á”á¶á“á‚áºá–á¸ 1 á‘áŸ… 25 áŸá„áŸ‹á‘á¸á˜áŸ‰áŸ‚ááŸ’áš / Incorrect water level! Acceptable values from 1 to 25 cm. "áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸááŸ– / Please enter the correct value:

source: âœ… Irrigation completed! Enough water.
kh: âœ… áŸáŸ’ášáŸ„á…áŸáŸ’ášá–ášá½á…ášá¶á›áŸ‹á á¾á™! á‘á¹á€á‚áŸ’ášá”áŸ‹á‚áŸ’ášá¶á“áŸ‹ / Irrigation completed! Enough water.

source: ğŸ’¦ Current level: {water_level} cm â± Time left: {hours}h {minutes}m ğŸ“Š Used: {used_m3:.2f} mÂ³ of {total_m3:.2f} mÂ³
kh: ğŸ’¦ áá½ášá›áŸáá€á»á„á‘áŸášá”á…áŸ’á…á»á”áŸ’á”á“áŸ’á“áŸ– {water_level} áŸá„áŸ‹á‘á¸á˜áŸ‰áŸ‚ááŸ’áš / Current level: {water_level} cm â± á–áŸá›áœáŸá›á¶á“áŸ…áŸá›áŸ‹áŸ– {hours}h {minutes}m / Time left: {hours}h {minutes}m ğŸ“Š á”á¶á“á”áŸ’ášá¾áŸ– {used_m3:.2f} mÂ³ á“áŸƒ {total_m3:.2f} mÂ³ / Used: {used_m3:.2f} mÂ³ of {total_m3:.2f} mÂ³

source: âš ï¸ Please enter a valid number (water level in cm)
kh: âš ï¸ áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸááŠáŸ‚á›ááŸ’ášá¹á˜ááŸ’ášá¼áœ (á€á˜áŸ’ášá·áá‘á¹á€á‚á·áá‡á¶áŸá„áŸ‹á‘á¸á˜áŸ‰áŸ‚ááŸ’áš) / Please enter a valid number (water level in cm)

source: Please, send your counter number after irrigation (mÂ³):
kh: áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€á”á“áŸ’á‘á¶á”áŸ‹á–á¸áŸáŸ’ášáŸ„á…áŸáŸ’ášá–ášá½á… (mÂ³): / Please, send your counter number after irrigation (mÂ³):

source: Please, send your counter number BEFORE irrigation (mÂ³)
kh: áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€á˜á»á“á–áŸá›áŸáŸ’ášáŸ„á…áŸáŸ’ášá– (mÂ³): / Please, send your counter number BEFORE irrigation (mÂ³)

source: Wrong fieldtype
kh: áá½ášá›áŸáá”á¶á“á”á‰áŸ’á…á¼á›á˜á·á“ááŸ’ášá¹á˜ááŸ’ášá¼áœ / Wrong fieldtype

source: âœ… Data saved! Used: {used_m3:.2f} mÂ³
kh: âœ… á‘á·á“áŸ’á“á“áŸá™ááŸ’ášá¼áœá”á¶á“ášá€áŸ’áŸá¶á‘á»á€! á”á¶á“á”áŸ’ášá¾áŸ– {used_m3:.2f} mÂ³ / Data saved! Used: {used_m3:.2f} mÂ³

source: âš ï¸ Error saving data
kh: âš ï¸ á€á¶ášášá€áŸ’áŸá¶á‘á»á€á‘á·á“áŸ’á“á“áŸá™á˜á·á“á”á¶á“áŸá˜áŸ’ášáŸá… / Error saving data

source: Enter actual water consumption (mÂ³):
kh: á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á¶ášá”áŸ’ášá¾á”áŸ’ášá¶áŸáŸ‹á‘á¹á€á‡á¶á€áŸ‹áŸáŸ’ááŸ‚á„á€áŸ’á“á»á„á€á»á„á‘áŸášá…áŸ†á€á¶ášá–á·áŸáŸ„á’ (mÂ³)áŸ– / Enter actual water consumption (mÂ³):

source: Now send counter value AFTER irrigation (mÂ³)
kh: áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…áŸ†á€á¶ášá–á·áŸáŸ„á’ášá”áŸáŸ‹á¢áŸ’á“á€á”á“áŸ’á‘á¶á”áŸ‹á–á¸áŸáŸ’ášáŸ„á…áŸáŸ’ášá–ášá½á… (mÂ³): / Now send counter value AFTER irrigation (mÂ³)

source: âš ï¸ Type correct number (like 125.5)
kh: âš ï¸ áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€áŠáŸ‚á›ááŸ’ášá¹á˜ááŸ’ášá¼áœ / Type correct number (like 125.5)

source: âœ… Data saved! Water used: {used_m3:.2f} mÂ³ Equivalent to: {actual_mm:.2f} mm
kh: âœ… á‘á·á“áŸ’á“á“áŸá™ááŸ’ášá¼áœá”á¶á“ášá€áŸ’áŸá¶á‘á»á€! / Data saved! á‘á¹á€á”áŸ’ášá¾á”áŸ’ášá¶áŸáŸ‹áŸ– {used_m3:.2f} mÂ³ / Water used: {used_m3:.2f} mÂ³ áŸáŸ’á˜á¾á“á¹á„áŸ– {actual_mm:.2f} mm / Equivalent to: {actual_mm:.2f} mm

source: âŒ Error: No start data found
kh: âŒ á˜á·á“á”á¶á“áŸá˜áŸ’ášáŸá…áŸ– ášá€á‘á·á“áŸ’á“á“áŸá™á…á¶á”áŸ‹á•áŸ’áŠá¾á˜á˜á·á“áƒá¾á‰ / Error: No start data found

source: âš ï¸ Error: The initial value of the counter cannot be greater than the final value! Please enter correct data.
kh: âš ï¸ á˜á·á“á”á¶á“áŸá˜áŸ’ášáŸá…áŸ– áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…á¶á”áŸ‹á•áŸ’áŠá¾á˜á˜á·á“á¢á¶á…á’áŸ†á‡á¶á„áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€á…á»á„á€áŸ’ášáŸ„á™á“áŸ„áŸ‡á‘áŸ! / Error: The initial value of the counter cannot be greater than the final value! áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸáá€á»á„á‘áŸášá‘á¹á€áŠáŸ‚á›ááŸ’ášá¹á˜ááŸ’ášá¼áœ / Please enter correct data.

source: âœ… Data saved! Water used: {used_m3:.2f} mÂ³ Equivalent to: {equivalent_mm:.2f} mm
kh: âœ… á‘á·á“áŸ’á“á“áŸá™ááŸ’ášá¼áœá”á¶á“ášá€áŸ’áŸá¶á‘á»á€! / Data saved! á‘á¹á€á”áŸ’ášá¾á”áŸ’ášá¶áŸáŸ‹áŸ– {used_m3:.2f} mÂ³ / Water used: {used_m3:.2f} mÂ³ áŸáŸ’á˜á¾á“á¹á„áŸ– {equivalent_mm:.2f} mm / Equivalent to: {equivalent_mm:.2f} mm

source: âš ï¸ Please enter a valid number (e.g. 150 or 75.5)
kh: âš ï¸ áŸá¼á˜á”á‰áŸ’á…á¼á›áá½ášá›áŸááŠáŸ‚á›ááŸ’ášá¹á˜ááŸ’ášá¼áœ (á§. 150 á¬ 75.5) / Please enter a valid number (e.g. 150 or 75.5)

source: âŒ Unsupported field type
kh: âŒ á‘á·á“áŸ’á“á“áŸá™áŠáŸ‚á›á”á¶á“á”á‰áŸ’á…á¼á›á˜á·á“ááŸ’ášá¹á˜ááŸ’ášá¼áœ / Unsupported field type

source: âš ï¸ Input data error
kh: âš ï¸ á€áŸ†á á»áŸá€áŸ’á“á»á„á€á¶ášá”á‰áŸ’á…á¼á›á‘á·á“áŸ’á“á“áŸá™ / Input data error
